Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.String)
Select by filter of by modification stamp
type: EnumeratorTypeEnum.BY_FILTER_NAME or EnumeratorTypeEnum.MODIFIED_OBJECTS_AFTER_STAMP
Parameter: Filter name or the modification stamp

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.String)
Select by filter of by modification stamp
type: EnumeratorTypeEnum.BY_FILTER_NAME or EnumeratorTypeEnum.MODIFIED_OBJECTS_AFTER_STAMP
objectType:
Parameter: Filter name or the modification stamp

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.Int32,System.Int32)
Instantiates a new enumerator for modified or deleted objects after Stamp.
type:
Enum:
modStamp:
saveStamp: